package Chapter_3_Class_and_Objects.Variant_A.Task_4;

/**
 * Created by Ingener_mobil on 02.11.2016.
 * Создать классы, спецификации которых приведены ниже.
 Определить конструкторы и методы setТип(), getТип(), toString().
 Определить дополнительно методы в классе, создающем массив объектов.
 Задать критерий выбора данных и вывести эти данные на консоль.
 В каждом классе, обладающем информацией, должно быть объявлено несколько конструкторов.
 * Abiturient: id, Фамилия, Имя, Отчество, Адрес, Телефон, Оценки.
 Создать массив объектов. Вывести:
 a) список абитуриентов, имеющих неудовлетворительные оценки;
 b) список абитуриентов, у которых сумма баллов выше заданной;
 c) выбрать заданное число n абитуриентов, имеющих самую высокую
 сумму баллов (вывести также полный список абитуриентов, имеющих
 полупроходную сумму)
 */
public class Programm {
    public static void main(String[] args) {
        Menu.Run();
    }
}
