package Chapter_3_Class_and_Objects.Variant_A.Task_1;

/**
 * Created by Ingener_mobil on 30.10.2016.
 * Создать классы, спецификации которых приведены ниже.
 Определить конструкторы и методы setТип(), getТип(), toString().
 Определить дополнительно методы в классе, создающем массив объектов.
 Задать критерий выбора данных и вывести эти данные на консоль.
 В каждом классе, обладающем информацией, должно быть объявлено несколько конструкторов.
 Student: id, Фамилия, Имя, Отчество, Дата рождения, Адрес, Телефон,
 Факультет, Курс, Группа.
 Создать массив объектов. Вывести:
 a) список студентов заданного факультета;
 b) списки студентов для каждого факультета и курса;
 c) список студентов, родившихся после заданного года;
 d) список учебной группы.

 */
public class Programm {
    public static void main(String[] args) {
        Menu.Run();
    }
}
