package Chapter_3_Class_and_Objects.Variant_A.Task_2;

/**
 * Created by Ingener_mobil on 01.11.2016.
 * Создать классы, спецификации которых приведены ниже.
 Определить конструкторы и методы setТип(), getТип(), toString().
 Определить дополнительно методы в классе, создающем массив объектов.
 Задать критерий выбора данных и вывести эти данные на консоль.
 В каждом классе, обладающем информацией, должно быть объявлено несколько конструкторов.
 Customer: id, Фамилия, Имя, Отчество, Адрес, Номер кредитной карточки,
 Номер банковского счета.
 Создать массив объектов. Вывести:
 a) список покупателей в алфавитном порядке;
 b) список покупателей, у которых номер кредитной карточки находится
 в заданном интервале
 */
public class Start {
    public static void main(String[] args) {
        Menu.Run();

    }
}
