package Chapter_7_Strings.Variant_B.Task_7;

/**
 * Created by Ingener_mobil on 11.11.2016.
 * Создать программу обработки текста учебника по программированию
 * с использованием классов: Символ, Слово, Предложение, Абзац, Лексема, Листинг,
 * Знак препинания и др. Во всех задачах с формированием текста заменять табуляции и
 * последовательности пробелов одним пробелом.Предварительно текст следует разобрать на
 * составные части, выполнить одно из перечисленных ниже заданий и вывести полученный результат.
 * Рассортировать слова текста по возрастанию доли гласных букв (отношение количества
 * гласных к общему количеству букв в слове).
 */
public class Programm {

    public static void main(String[] args) {
        Run run = new Run();
        run.Init();
    }
}

