package Chapter_3_Class_and_Objects.Variant_A.Task_5;

/**
 * Created by Ingener_mobil on 02.11.2016.
 * Создать классы, спецификации которых приведены ниже.
 Определить конструкторы и методы setТип(), getТип(), toString().
 Определить дополнительно методы в классе, создающем массив объектов.
 Задать критерий выбора данных и вывести эти данные на консоль.
 В каждом классе, обладающем информацией, должно быть объявлено несколько конструкторов.
 * Book: id, Название, Автор (ы), Издательство, Год издания, Количество страниц, Цена, Тип переплета.
 Создать массив объектов. Вывести:
 a) список книг заданного автора;
 b) список книг, выпущенных заданным издательством;
 c) список книг, выпущенных после заданного года.
 */
public class Programm {
    public static void main(String[] args) {
        Menu.Run();
    }
}
